app/controllers/uploaded_files_controller.rb

SELECT * FROM `uploaded_files`
---
  def index
    @uploaded_files = UploadedFile.all

SELECT * FROM `uploaded_files` WHERE (`uploaded_files`.`id` = 4)
---
  def show
    @uploaded_file = UploadedFile.find(params[:id])

INSERT INTO `uploaded_files` (`created_at`, `updated_at`, `file_name`, `file_size`, `file_type`) VALUES('2010-08-15 23:20:08', '2010-08-15 23:20:08', '_1281914408..pdf', NULL, 'application/pdf')
---
  def create
    @uploaded_file = UploadedFile.new(params[:uploaded_file])

    respond_to do |format|
      if @uploaded_file.save

SELECT * FROM `uploaded_files` WHERE (`uploaded_files`.`id` = 4)
DELETE FROM `uploaded_files` WHERE `id` = 4
---
  def destroy
    @uploaded_file = UploadedFile.find(params[:id])
    @uploaded_file.destroy